In [11]:
import pandas as pd
num = 0
for data in  pd.read_csv("employees_202206172332.csv", chunksize = 5000 ):
    num = num+1
    name = 'emps_'+str(num)+'.csv'
    data.to_csv(name, index=False)
    #print(name, 'loaded')

In [29]:
import glob
path = r'D:\Code_Place\Data-Science\PySpark_SparkSql\files' # use your path
filenames = glob.glob(path + "/*.csv")
df = pd.concat(map(pd.read_csv, filenames))
df.head()

   emp_no emp_title_id  birth_date  first_name  last_name gender   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco      M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande      F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb      F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff      M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann      F  1991-01-18

In [30]:
print(len(df))

300024

In [42]:
df['Full Name'] = df['first_name'] +' '+ df['last_name'].map(str)

df

,emp_no,emp_title_id,birth_date,first_name,last_name,gender,hire_date,Full Name
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,Hideyuki Zallocco
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,Byong Delgrande
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,Berry Babb
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,Xiong Verhoeff
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,Abdelkader Baumann
...,...,...,...,...,...,...,...,...
4995,252592,e0003,1965-01-12,Sachem,McDermid,M,1985-10-02,Sachem McDermid
4996,78048,s0001,1953-05-13,Jaewoo,Jumpertz,M,1988-05-28,Jaewoo Jumpertz
4997,258683,e0003,1959-01-22,Martijn,Vilarrasa,F,1985-07-17,Martijn Vilarrasa
4998,82009,e0004,1963-02-08,Eckart,Barinka,M,1989-05-13,Eckart Barinka
4999,448398,s0001,1957-09-21,Kankanahalli,Speel,M,1985-04-21,Kankanahalli Speel